In [3]:
# the probability that the sum of two dices equals seven
d = {(i,j):i+j for i in range(1,7) for j in range(1,7)}
from collections import defaultdict
dinv = defaultdict(list)
for i,j in d.iteritems():
    dinv[j].append(i)
x = {i:len(j)/36. for i,j in dinv.iteritems()}
x

{2: 0.027777777777777776,
 3: 0.05555555555555555,
 4: 0.08333333333333333,
 5: 0.1111111111111111,
 6: 0.1388888888888889,
 7: 0.16666666666666666,
 8: 0.1388888888888889,
 9: 0.1111111111111111,
 10: 0.08333333333333333,
 11: 0.05555555555555555,
 12: 0.027777777777777776}

In [8]:
# the probability that half the product of three dice wil exceed their sum
d = {(i,j,k):((i*j*k)/2>i+j+k) for i in range(1,7) for j in range(1,7) for k in range(1,7)}
from collections import defaultdict
dinv = defaultdict(list)
for i,j in d.iteritems(): dinv[j].append(i)
x = {i:len(j)/6.0**3 for i,j in dinv.iteritems()}
x

{False: 0.37037037037037035, True: 0.6296296296296297}

In [17]:
# introducing pandas
from pandas import DataFrame
d = DataFrame(index = [(i,j) for i in range(1,7) for j in range(1,7)], columns = ['sm','d1','d2','pd1','pd2','p'])
d.d1 = [i[0] for i in d.index]
d.d2 = [i[1] for i in d.index]
d.sm = map(sum,d.index)
d.head(5) # show first five lines

        sm  d1  d2  pd1  pd2    p
(1, 1)   2   1   1  NaN  NaN  NaN
(1, 2)   3   1   2  NaN  NaN  NaN
(1, 3)   4   1   3  NaN  NaN  NaN
(1, 4)   5   1   4  NaN  NaN  NaN
(1, 5)   6   1   5  NaN  NaN  NaN

In [19]:
d.loc[d.d1<=3,'pd1']=1/9.
d.loc[d.d1 > 3, 'pd1']=2/9.
d.pd2 = 1/6.
d.head(10)

        sm  d1  d2       pd1       pd2    p
(1, 1)   2   1   1  0.111111  0.166667  NaN
(1, 2)   3   1   2  0.111111  0.166667  NaN
(1, 3)   4   1   3  0.111111  0.166667  NaN
(1, 4)   5   1   4  0.111111  0.166667  NaN
(1, 5)   6   1   5  0.111111  0.166667  NaN
(1, 6)   7   1   6  0.111111  0.166667  NaN
(2, 1)   3   2   1  0.111111  0.166667  NaN
(2, 2)   4   2   2  0.111111  0.166667  NaN
(2, 3)   5   2   3  0.111111  0.166667  NaN
(2, 4)   6   2   4  0.111111  0.166667  NaN

In [20]:
d.p = d.pd1 * d.pd2
d.head(5)

        sm  d1  d2       pd1       pd2          p
(1, 1)   2   1   1  0.111111  0.166667  0.0185185
(1, 2)   3   1   2  0.111111  0.166667  0.0185185
(1, 3)   4   1   3  0.111111  0.166667  0.0185185
(1, 4)   5   1   4  0.111111  0.166667  0.0185185
(1, 5)   6   1   5  0.111111  0.166667  0.0185185

In [22]:
d.groupby('sm')['p'].sum()

sm
2     0.018519
3     0.037037
4     0.055556
5     0.092593
6     0.129630
7     0.166667
8     0.148148
9     0.129630
10    0.111111
11    0.074074
12    0.037037
Name: p, dtype: float64